app/views/user_mailer/welcome_email.html.erb

				<b><%= @shipping_detail.product.question_4_name %> </b> <br/>
				<% @shipping_detail.product.question_options.each do |question_option| %>
---
SELECT "products".* FROM "products" WHERE ("products"."id" = 1) LIMIT 1