app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE (usell_category_code IS NOT NULL) GROUP BY usell_category_code
---
  def index
    @categories = Category.all

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "980190962-mystring"]]
---
  def show
    @category = Category.find(params[:id])

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "980190962-mystring"]]
---
  def edit
    @category = Category.find(params[:id])

INSERT INTO "categories" ("question_4_name", "question_1_name", "question_2_option_1_multiplier", "question_3_option_3_multiplier", "question_4_is_enabled", "is_popular", "updated_at", "question_1_option_1_multiplier", "question_3_is_enabled", "question_1_option_2_multiplier", "name", "question_3_option_4_multiplier", "question_3_option_2_multiplier", "question_3_option_1_multiplier", "created_at", "question_2_name", "question_3_name", "question_1_is_enabled", "question_2_is_enabled", "question_2_option_2_multiplier") VALUES (NULL, NULL, NULL, NULL, NULL, 'f', '2011-02-03 23:12:26.000000', NULL, NULL, NULL, 'MyString', NULL, NULL, NULL, '2011-02-03 23:12:26.000000', NULL, NULL, NULL, NULL, NULL)
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "980190962-mystring"]]
UPDATE "categories" SET "question_3_option_2_multiplier" = 0.6, "question_2_name" = 'Can the phone make calls?', "question_3_name" = 'Condition of phone?', "question_3_option_3_multiplier" = 0.8, "question_3_is_enabled" = 't', "question_3_option_4_multiplier" = 1.0, "question_2_is_enabled" = 't', "question_3_option_1_multiplier" = 0.4, "question_2_option_1_multiplier" = 1.0, "updated_at" = '2010-12-14 18:34:50.809596', "question_2_option_2_multiplier" = 0.8 WHERE ("categories"."id" = 3)
---
  def update
    @category = Category.find(params[:id])


    respond_to do |format|
      if @category.update_attributes(params[:category])

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "980190962-mystring"]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 980190962]]
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy