app/controllers/home_controller.rb

SELECT "categories".* FROM "categories" WHERE ("categories"."is_popular" = 't') LIMIT 5
SELECT "products".* FROM "products" WHERE ("products"."is_popular" = 't') LIMIT 4
---
  def index
        @categories = Category.find_all_by_is_popular(true, :limit => 5)

        @products = Product.find_all_by_is_popular(true, :limit => 4)