app/controllers/manufacturers_controller.rb

  def index
    @manufacturers = Manufacturer.all
---
SELECT "manufacturers".* FROM "manufacturers"

  def show
    @manufacturer = Manufacturer.find(params[:id])
---
SELECT "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT 1  [["id", "980190962"]]

  def edit
    @manufacturer = Manufacturer.find(params[:id])
---
SELECT "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT 1  [["id", "980190962"]]

  def create
    @manufacturer = Manufacturer.new(params[:manufacturer])


    respond_to do |format|
      if @manufacturer.save
---
INSERT INTO "manufacturers" ("updated_at", "name", "created_at") VALUES ('2012-04-06 17:26:09.000000', 'MyString', '2012-04-06 17:26:09.000000')

  def update
    @manufacturer = Manufacturer.find(params[:id])
---
SELECT "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT 1  [["id", "980190962"]]

  def destroy
    @manufacturer = Manufacturer.find(params[:id])
    @manufacturer.destroy
---
SELECT "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "manufacturers" WHERE "manufacturers"."id" = ?  [["id", 980190962]]