app/controllers/products_controller.rb

  def index
    if params[:popular] == 'true'
  		@products = Product.find_all_by_is_popular(true)
  	elsif !params[:category_id].nil?
      Category.find_all_by_usell_category_code(params[:category_id]).each do |category|
        if @products.nil?
          @products = category.products
        else
          @products += category.products
        end
      end
  	else
  		@products = Product.all
---
SELECT "products".* FROM "products"

  def accept_quote
    @question_response = QuestionResponse.new(params[:question_response])

    @question_4_params = params[:question_response][:question_4]
	  @question_4 = @question_4_params.join(", ") if @question_4_params

    @question_response.question_4 = @question_4

    if @question_response.save
---
INSERT INTO "question_responses" ("question_4", "question_1", "question_3", "product_id", "created_at", "question_2", "updated_at") VALUES ('1, 2', 'True', '3', 1, '2010-12-30 20:06:48.807590', 'False', '2010-12-30 20:06:48.807590')

  def show
    @product = Product.find(params[:id])
    #@title_line = "Sell your "+ @product.name + " - Depstar"
    if @product.series_list
      if !@product.series_list.name.include?("iPhone")
        @title_line = "Sell Your Used or Broken #{@product.manufacturer.name}  #{@product.category.name} #{@product.series_list.name} #{@product.name}- Depstar"
      else
        @title_line = "Sell Your Used or Broken #{@product.name}- Depstar"
      end
    else
      if @product.category.name.include?("Tablet")
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "980190962-mystring"]]
SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 3) LIMIT 1

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("question_4_name", "question_3_option_3_multiplier", "question_1_option_1_price", "question_1_is_enabled", "question_3_option_2_multiplier", "question_2_option_1_multiplier", "question_2_option_2_multiplier", "question_2_is_enabled", "category_id", "photo_updated_at", "photo_file_size", "name", "created_at", "is_popular", "question_1_option_2_price", "question_1_option_1_multiplier", "question_3_option_1_multiplier", "description", "manufacturer", "photo_file_name", "question_1_option_2_multiplier", "question_2_name", "question_3_option_4_multiplier", "question_3_name", "photo_content_type", "question_1_name", "question_3_is_enabled", "question_2_option_2_price", "question_2_option_1_price", "price", "manufacturer_id", "question_4_is_enabled", "updated_at") VALUES (NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 1, '2010-10-06 11:04:37.000000', 100, 'MyString', '2012-04-06 17:26:09.000000', 't', NULL, NULL, NULL, 'MyString', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 1.234, NULL, NULL, '2012-04-06 17:26:09.000000')

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "980190962-mystring"]]
UPDATE "products" SET "photo_content_type" = 'image/jpeg', "updated_at" = '2010-12-09 19:33:24.094100', "photo_file_size" = 32272, "photo_file_name" = 'iphone-4.jpg', "photo_updated_at" = '2010-12-09 19:33:24.091153' WHERE ("products"."id" = 1)

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "980190962-mystring"]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 980190962]]