app/controllers/shipping_details_controller.rb

SELECT "shipping_details".* FROM "shipping_details"
---
  def index
    @shipping_details = ShippingDetail.all(:order => "created_at desc")

SELECT "shipping_details".* FROM "shipping_details" WHERE ("shipping_details"."id" = 980190962) LIMIT 1
---
  def show
    @shipping_detail = ShippingDetail.find(params[:id])

SELECT "shipping_details".* FROM "shipping_details" WHERE ("shipping_details"."id" = 980190962) LIMIT 1
---
  def edit
    @shipping_detail = ShippingDetail.find(params[:id])

SELECT "products".* FROM "products" WHERE ("products"."id" = 1) LIMIT 1
INSERT INTO "shipping_details" ("question_response_id", "address2", "first_name", "zip", "city", "state", "paypal_email", "created_at", "email", "requires_box", "product_id", "address1", "last_name", "payment_method_id", "updated_at") VALUES (27, 'Unit #3', 'Charlie', '02151', 'Revere', 'MA', 'test@paypaltest.com', '2010-12-30 19:46:54.032253', 'charlie@email.com', 't', 1, '101 Test St', 'Test', 2, '2010-12-30 19:46:54.032253')
---
  def create
    @shipping_detail = ShippingDetail.new(params[:shipping_detail])

    @product = Product.find(params[:shipping_detail][:product_id])
    @question_response = QuestionResponse.find(params[:shipping_detail][:question_response_id])

    @tos = params[:tos]

    @device = Device.new(:product => @product, :question_response => @question_response)
    if @device.valid?
      @device.save
    end

    # Take a snapshot of the initial offer
    #@shipping_detail.offer = @question_response.quote unless @question_response.nil?
    #@shipping_detail.final_offer = @question_response.quote unless @question_response.nil?
    @device.offer         = @question_response.quote unless @question_response.nil?
    @device.final_offer   = @question_response.quote unless @question_response.nil?

    @shipping_detail.devices[0] = @device

    respond_to do |format|
      if @tos.nil?
        flash[:error] = "You must first agree to the terms of service"
        format.html { render :action => "new", :product_id => @product.id, :question_response_id => @question_response.id, :notice => "You must first agree to the terms of service" }
        format.xml  { render :xml => @shipping_detail.errors, :status => :unprocessable_entity }
      elsif @shipping_detail.save

SELECT "shipping_details".* FROM "shipping_details" WHERE ("shipping_details"."id" = 980190962) LIMIT 1
---
  def update
    @shipping_detail = ShippingDetail.find(params[:id])

SELECT "shipping_details".* FROM "shipping_details" WHERE ("shipping_details"."id" = 980190962) LIMIT 1
DELETE FROM "shipping_details" WHERE ("shipping_details"."id" = 980190962)
---
  def destroy
    @shipping_detail = ShippingDetail.find(params[:id])
    @shipping_detail.destroy