app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("password_salt", "last_request_at", "email", "login_count", "created_at", "last_login_at", "persistence_token", "failed_login_count", "current_login_ip", "username", "last_login_ip", "current_login_at", "crypted_password", "updated_at") VALUES ('j1DYsByMRtS6RJAmhVmH', '2011-01-05 16:41:26.252760', 'charles.palleschi@sparkwiresolutions.com', 1, '2011-01-05 16:41:26.253263', NULL, 'a0812c923f342f3f5cff1cc09f5ebb65537c3d00c0cd6950c22399582ad34b367abdc924b16961067a195a606356cdf2f29f26e8edcf522940d473bbb3d4946e', 0, '127.0.0.1', 'charles', NULL, '2011-01-05 16:41:26.252582', '090e54ba6b1cf4ce250fd30daec96360d4f122ad0f6901fa4a6e3917e2471a5f0d3b872bafe70d43eec812f830ff65caabd4f36903f5e0881246be725d8a3713', '2011-01-05 16:41:26.253263')

  def edit
    if params[:id].nil? || params[:id] == "current"
      @user = current_user
    else
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def update

    if params[:id].empty? || params[:id] == "current"
      @user = current_user
    else
      @user = User.find(params[:id])
    end

    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
UPDATE "users" SET "updated_at" = '2011-02-03 23:06:48.137071', "last_request_at" = '2011-02-03 23:06:48.136668' WHERE ("users"."id" = 1)