app/views/categories/show.html.erb

SELECT "products".* FROM "products" WHERE ("products".category_id = 3)
---

					<% @category.products.each do |product|  %>