app/views/products/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :category_id %><br />
	<%= f.select :category_id, Category.all.map { |x| [x.name, x.id ]}, :prompt => "Select Category" %>