app/views/products/show.html.erb

SELECT "question_options".* FROM "question_options" WHERE ("question_options".category_id = 3)
SELECT "questions".* FROM "questions" WHERE ("questions".category_id = 3)
---
							<b><%= @product.question_4_name %> </b> <br/>
							<% @product.question_options.each do |question_option| %>