app/views/shipping_details/_form.html.erb

		  	<p>
		  		<% PaymentMethod.all.each do |payment_method| %>
---
SELECT "payment_methods".* FROM "payment_methods"