app/views/shipping_details/show.html.erb

SELECT "products".* FROM "products" WHERE ("products"."id" = 1) LIMIT 1
SELECT "question_options".* FROM "question_options" WHERE ("question_options".category_id = 3)
---
					<b><%= @shipping_detail.product.question_4_name %> </b> <br/>
					<% @shipping_detail.product.question_options.each do |question_option| %>